notes/meeting_2021may02.org
** meeting links
This file of notes can be read over at github:
https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021may02.md
code examples:
https://github.com/doomvox/raku-study/tree/main/bin/2021may02/

** agenda stuff
*** 69 cent tour of git and github
https://github.com/doomvox/raku-study/blob/main/notes/69cent_tour_git.md
*** bruce gray on his discrete fourier transform solution:
http://rosettacode.org/wiki/Discrete_Fourier_transform#Raku
*** bruce gray rosetta code entry:  https://rosettacode.org/wiki/Tree_from_nesting_levels#Raku 
*** type system: what is accepted by what 
**** is anything ever cast automatically
*** raku classes as data containers
**** https://github.com/doomvox/raku-study/tree/main/bin/2021apr25/data_container_class.raku
*** programming in the large (david christensen)
**** larger applications
**** circular dependencies in functions

** ongoing
*** raku idioms
**** https://github.com/doomvox/raku-study/blob/main/notes/idioms.org
***** https://gfldex.wordpress.com/2021/04/16/all-your-idioms-are-belong-to-us/
***** maybe: favor methods over functions?

** announcements
*** Next month is mother's day.  No meeting.
** appendix: the usual links
*** code examples
https://github.com/doomvox/raku-study/tree/main/bin/2021may02
*** meeting notes (material from this file)
https://github.com/doomvox/raku-study/tree/main/notes/meeting_2021may02.md
*** SF Perl page, has links to mailing list
http://sf.pm.org/
*** perl6-users mailing list archive
https://www.nntp.perl.org/group/perl.perl6.users/

** misc links via chat

*** Bill Michels : https://perlmonks.org/index.pl?node_id=861966

*** Bill Michels : https://www.openpgp.org/

*** David Christensen : https://docs.github.com/en/github/authenticating-to-github/githubs-ssh-key-fingerprints

*** Bruce Gray : git init ; git add . ; git commit -m 'Initial commit'
*** Bruce Gray : https://cli.github.com/
*** Bruce Gray : https://apple.stackexchange.com/questions/48502/how-can-i-permanently-add-my-ssh-private-key-to-keychain-so-it-is-automatically
*** Bruce Gray : https://metacpan.org/pod/release/VPARSEVAL/Devel-Calltree-0.00_3/script/calltree
*** Bruce Gray : http://rosettacode.org/wiki/Discrete_Fourier_transform#Raku
*** Bruce Gray : http://rosettacode.org/wiki/Coprime_triplets#Raku



