notes/meeting_2021may02.md
- [meeting links](#org68ae67a)
  - [agenda stuff](#orgb7c000f)
    - [69 cent tour of git and github](#orgb65458d)
    - [bruce gray on his discrete fourier transform solution:](#org265b113)
    - [bruce gray rosetta code entry:  <https://rosettacode.org/wiki/Tree_from_nesting_levels#Raku>](#org40bf4ef)
    - [type system: what is accepted by what](#orge1c1815)
      - [is anything ever cast automatically](#orgdf6a980)
    - [raku classes as data containers](#orgab464ac)
      - [<https://github.com/doomvox/raku-study/tree/main/bin/2021apr25/data_container_class.raku>](#org7e0d133)
    - [programming in the large (david christensen)](#orga4b98bb)
      - [larger applications](#org262865d)
      - [circular dependencies in functions](#org0f54aae)
  - [ongoing](#org19c2aae)
    - [raku idioms](#orgb1d748e)
      - [<https://github.com/doomvox/raku-study/blob/main/notes/idioms.org>](#org1452ae2)
  - [announcements](#orgf7a65a6)
    - [Next month is mother's day.  No meeting.](#orgfa753ff)
  - [appendix: the usual links](#orge03c828)
    - [code examples](#org7559e71)
    - [meeting notes (material from this file)](#orge4c4ab1)
    - [SF Perl page, has links to mailing list](#orgbb0e303)
    - [perl6-users mailing list archive](#org4e0b4b4)
  - [misc links via chat](#orgcbdd36e)
    - [Bill Michels : <https://perlmonks.org/index.pl?node_id=861966>](#orgebddf88)
    - [Bill Michels : <https://www.openpgp.org/>](#org1e96464)
    - [David Christensen : <https://docs.github.com/en/github/authenticating-to-github/githubs-ssh-key-fingerprints>](#org1b9bf4a)
    - [Bruce Gray : git init ; git add . ; git commit -m 'Initial commit'](#orgc77c508)
    - [Bruce Gray : <https://cli.github.com/>](#orgec49dea)
    - [Bruce Gray : <https://apple.stackexchange.com/questions/48502/how-can-i-permanently-add-my-ssh-private-key-to-keychain-so-it-is-automatically>](#org1614626)
    - [Bruce Gray : <https://metacpan.org/pod/release/VPARSEVAL/Devel-Calltree-0.00_3/script/calltree>](#orga184054)
    - [Bruce Gray : <http://rosettacode.org/wiki/Discrete_Fourier_transform#Raku>](#org8424a70)
    - [Bruce Gray : <http://rosettacode.org/wiki/Coprime_triplets#Raku>](#org6039899)


<a id="org68ae67a"></a>

# meeting links

This file of notes can be read over at github: <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021may02.md> code examples: <https://github.com/doomvox/raku-study/tree/main/bin/2021may02/>


<a id="orgb7c000f"></a>

# agenda stuff


<a id="orgb65458d"></a>

## 69 cent tour of git and github

<https://github.com/doomvox/raku-study/blob/main/notes/69cent_tour_git.md>


<a id="org265b113"></a>

## bruce gray on his discrete fourier transform solution:

<http://rosettacode.org/wiki/Discrete_Fourier_transform#Raku>


<a id="org40bf4ef"></a>

## bruce gray rosetta code entry:  <https://rosettacode.org/wiki/Tree_from_nesting_levels#Raku>


<a id="orge1c1815"></a>

## type system: what is accepted by what


<a id="orgdf6a980"></a>

### is anything ever cast automatically


<a id="orgab464ac"></a>

## raku classes as data containers


<a id="org7e0d133"></a>

### <https://github.com/doomvox/raku-study/tree/main/bin/2021apr25/data_container_class.raku>


<a id="orga4b98bb"></a>

## programming in the large (david christensen)


<a id="org262865d"></a>

### larger applications


<a id="org0f54aae"></a>

### circular dependencies in functions


<a id="org19c2aae"></a>

# ongoing


<a id="orgb1d748e"></a>

## raku idioms


<a id="org1452ae2"></a>

### <https://github.com/doomvox/raku-study/blob/main/notes/idioms.org>

1.  <https://gfldex.wordpress.com/2021/04/16/all-your-idioms-are-belong-to-us/>

2.  maybe: favor methods over functions?


<a id="orgf7a65a6"></a>

# announcements


<a id="orgfa753ff"></a>

## Next month is mother's day.  No meeting.


<a id="orge03c828"></a>

# appendix: the usual links


<a id="org7559e71"></a>

## code examples

<https://github.com/doomvox/raku-study/tree/main/bin/2021may02>


<a id="orge4c4ab1"></a>

## meeting notes (material from this file)

<https://github.com/doomvox/raku-study/tree/main/notes/meeting_2021may02.md>


<a id="orgbb0e303"></a>

## SF Perl page, has links to mailing list

<http://sf.pm.org/>


<a id="org4e0b4b4"></a>

## perl6-users mailing list archive

<https://www.nntp.perl.org/group/perl.perl6.users/>


<a id="orgcbdd36e"></a>

# misc links via chat


<a id="orgebddf88"></a>

## Bill Michels : <https://perlmonks.org/index.pl?node_id=861966>


<a id="org1e96464"></a>

## Bill Michels : <https://www.openpgp.org/>


<a id="org1b9bf4a"></a>

## David Christensen : <https://docs.github.com/en/github/authenticating-to-github/githubs-ssh-key-fingerprints>


<a id="orgc77c508"></a>

## Bruce Gray : git init ; git add . ; git commit -m 'Initial commit'


<a id="orgec49dea"></a>

## Bruce Gray : <https://cli.github.com/>


<a id="org1614626"></a>

## Bruce Gray : <https://apple.stackexchange.com/questions/48502/how-can-i-permanently-add-my-ssh-private-key-to-keychain-so-it-is-automatically>


<a id="orga184054"></a>

## Bruce Gray : <https://metacpan.org/pod/release/VPARSEVAL/Devel-Calltree-0.00_3/script/calltree>


<a id="org8424a70"></a>

## Bruce Gray : <http://rosettacode.org/wiki/Discrete_Fourier_transform#Raku>


<a id="org6039899"></a>

## Bruce Gray : <http://rosettacode.org/wiki/Coprime_triplets#Raku>
